cask_args appdir: "/Applications"

tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/versions'
tap 'bramstein/webfonttools'
tap "thoughtbot/formulae"
tap "homebrew/services"


# brew "postgres", restart_service: :changed
# brew "redis", restart_service: :changed
# brew 'ansible'
brew 'mas'
# brew 'phantomjs'
# brew 'pow'
brew "hub"
brew "parity"
brew "qt@5.5" if MacOS::Xcode.installed?
brew "reattach-to-user-namespace"
brew "yarn"
brew 'ack'
brew 'aircrack-ng'
brew 'autoconf'
brew 'automake'
brew 'bash'
brew 'bash-completion2'
brew 'bfg'
brew 'binutils'
brew 'binwalk'
brew 'boot2docker'
brew 'cifer'
brew 'cmake'
brew 'coreutils'
brew 'ctags'
brew 'curl'
brew 'dark-mode'
brew 'dex2jar'
brew 'dns2tcp'
brew 'dnsmasq'
brew 'docker'
brew 'fcrackzip'
brew 'findutils'
brew 'fish'
brew 'foremost'
brew 'freetype'
brew 'gdbm'
brew 'gettext'
brew 'git'
brew 'git-extras'
brew 'git-flow'
brew 'git-lfs'
brew 'hashpump'
brew 'heroku'
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/screen'
brew 'homebrew/php/php55' args: ["with-gmp"]
brew 'homebrew/x11/xpdf'
brew 'hydra'
brew 'icu4c'
brew 'imagemagick' args:['with-webp']
brew 'iperf'
brew 'john'
brew 'jpeg'
brew 'knock'
brew 'libevent'
brew 'libgpg-error'
brew 'libksba'
brew 'libpng'
brew 'libsass'
brew 'libtool'
brew 'libxml2'
brew 'libxslt'
brew 'lua'
brew 'mackup'
brew 'makedepend'
brew 'mariadb'
brew 'mcrypt'
brew 'mhash'
brew 'mitmproxy'
brew 'mono'
brew 'moreutils'
brew 'netpbm'
brew 'nmap'
brew 'nvm'
brew 'openssl'
brew 'p7zip'
brew 'pandoc'
brew 'pcre'
brew 'pcre2'
brew 'pigz'
brew 'pkg-config libffi'
brew 'pkg-config'
brew 'pngcheck'
brew 'pv'
brew 'python'
brew 'python3'
brew 'readline'
brew 'rename'
brew 'rhino'
brew 'sfnt2woff'
brew 'sfnt2woff-zopfli'
brew 'socat'
brew 'speedtest_cli'
brew 'sphinx-doc'
brew 'sqlite'
brew 'sqlmap'
brew 'ssh-copy-id'
brew 'tcpflow'
brew 'tcpreplay'
brew 'tcptrace'
brew 'terminal-notifier'
brew 'tmux'
brew 'tree'
brew 'ucspi-tcp'
brew 'unixodbc'
brew 'v8'
brew 'vim', args: ["override-system-vi", "with-lua"]
brew 'webkit2png'
brew 'wget', args: ["with-iri"]
brew 'woff2'
brew 'xz'
brew 'zopfli'
# Install RingoJS and Narwhal.
# Note that the order in which these are installed is important;
# see http://git.io/brew-narwhal-ringo.
brew 'ringojs'
brew 'narwhal'

brew 'libyaml'

# Cask applications

cask "gpgtools"
cask '1password'
cask 'angry-ip-scanner'
cask 'anvil'
cask 'appcleaner'
cask 'atom'
cask 'battle-net'
cask 'boom'
cask 'calibre'
cask 'commander-one'
cask 'dotnet'
cask 'dropbox'
cask 'firefoxdeveloperedition'
cask 'flux'
cask 'gitkraken'
cask 'gitter'
cask 'google-chrome'
cask 'google-drive'
cask 'google-photos-backup'
cask 'harvest'
cask 'istat-menus'
cask 'iterm2'
cask 'java'
cask 'macdown'
cask 'mono-mdk'
cask 'onyx'
cask 'postgres'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'tower'
cask 'transmission'
cask 'unetbootin'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'wireshark'
cask 'xquartz'

# Install developer friendly quick look plugins; see https://github.com/sindresorhus/quick-look-plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'



# Mac App Store or MAS. Need to use app ID to retrieve.

mas sigin patrick.meunier@me.com